Revit 2027 API
DataTransferMode Enumeration
 Describes the data transfer mode.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum DataTransferMode
Public Enumeration DataTransferMode
public enum class DataTransferMode
type DataTransferMode
Members
Member name | Value | Description
Download | 0 |  Transfer data from server to client.
Undefined | -1 |  Undefined mode.
Upload | 1 |  Transfer data from client to server.
See Also
Reference
Autodesk.Revit.DB.Events Namespace